about/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>关于我 - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>关于我</h1>
            
<div id="outline-container-org7192811" class="outline-2">
<h2 id="org7192811">个人简介</h2>
<div class="outline-text-2" id="text-org7192811">
<p>
<code>刘恩泽</code>, 男, 联系方式: <code>liuenze6516#gmail</code>
</p>
</div>
<div id="outline-container-org5570ef3" class="outline-3">
<h3 id="org5570ef3">上海票牛网 <b>core developer</b> <b>2015 至今</b></h3>
<div class="outline-text-3" id="text-org5570ef3">
<ul class="org-ul">
<li><code>商品系统</code></li>
<li><code>运营系统</code> (秒杀，抽奖，优惠券，特卖活动等)</li>
<li><code>演出票务系统</code> (座位编辑, 打票, 验票等)</li>
<li><code>搜索</code> , <code>演出推荐</code> , <code>spark 数据分析</code> , <code>管理系统</code> 等</li>
<li><code>监控</code> , <code>发布</code> , <code>回滚</code> , <code>备份</code> 等运维相关</li>
</ul>
</div>
</div>

<div id="outline-container-orgf82873e" class="outline-3">
<h3 id="orgf82873e">上海大众点评-交易线-商家系统 <b>高级软件工程师(P6)</b> <b>2013-2015</b></h3>
<div class="outline-text-3" id="text-orgf82873e">
<ul class="org-ul">
<li>点评团购制作系统</li>
<li>制作审核质检系统</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfb27f2" class="outline-3">
<h3 id="orgcfb27f2">南京华为-运营商 BG-企业通讯产品线 <b>软件工程师</b> <b>2011-2013</b></h3>
<div class="outline-text-3" id="text-orgcfb27f2">
<ul class="org-ul">
<li><code>即时通讯软件</code> 服务端开发</li>
<li><code>VOIP</code> 和 <code>企业会议系统</code> 的业务层开发</li>
</ul>
</div>
</div>

<div id="outline-container-org6441097" class="outline-3">
<h3 id="org6441097">南京大学-数学系-基础数学 本科 <b>4.1/5</b> <b>2007-2011</b></h3>
</div>
</div>

<div id="outline-container-orgb3a7c22" class="outline-2">
<h2 id="orgb3a7c22">项目经历</h2>
<div class="outline-text-2" id="text-orgb3a7c22">
</div>
<div id="outline-container-org729eab2" class="outline-3">
<h3 id="org729eab2">票牛网</h3>
<div class="outline-text-3" id="text-org729eab2">
<ul class="org-ul">
<li>2015-09 信息系统(票档，场次, 演出，场馆，城市) + 商品系统(票) + 用户系统用户</li>
<li>2015-10 商家系统(挂票), 邀请注册, 管理后台, 文件服务(qiniu), 订单系统 (下单)</li>
<li>2015-11 [app v1.0] 增加反馈，订单发货, 优化演出搜索, 订单通知，用户操作记录, 演出增加类目, 微信第三方登陆,抽奖活动，红包</li>
<li>2015-12 微信分享， 订单防刷, 票牛 pc 版, 演出艺人, 订单支持不同取票方式, 库存管理与采购后台, 访问来源分析</li>
<li>2016-01 区分商家与个人，增加个人转票, 拼团活动，运营位</li>
<li>2016-02 支持多城市，验证码直接登陆，票品区分(连座，不可剩单张，最多最少购买张数), spark 分析日志跑用户 uvpv</li>
<li>2016-03 增加 PUSH, 订单优惠支持折扣, 点赞活动</li>
<li>2016-04 后台增加场次和场馆管理, 区分演出所在城市和发布城市，增加折扣和热门票, 演出关注与有票通知， 特卖活动</li>
<li>2016-05 增加 elk 的日志分析，会员福利，秒杀活动</li>
<li>2016-06 相关演出推荐, 订单增加邮费，评论点赞，评论回复，开发环境 docker 搭建(mvn,gitlab,ci)</li>
<li>2016-07 消息中心，spark 计算相关演出，zabbix 监控，短信送达报告</li>
<li>2016-08 部分非核心业务 duboo 服务化，迪士尼对接</li>
<li>2016-09 答题活动, 业务数据备份</li>
<li>2016-10 统计内容分库以及服务化, 发布脚本支持多 nginx, 使用阿里云负载均衡</li>
<li>2016-11~2017-02 <code>负责运营团队</code></li>
<li>2017-03 商家子账户, 商家运营活动，商家分销系统, 票务系统（锁票，打票，验票)</li>
<li>2017-04 迁移大数据存储至阿里 odps, 线上 spark 环境, 自动发货系统(对接顺丰自动打印)</li>
<li>2017-05 在线选座挂售</li>
<li>技术相关: spark, ansible, zabbix, elk, ruby, qiniu, daogen, docker, scala, mysql &#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org4cbe1f8" class="outline-3">
<h3 id="org4cbe1f8">点评商品制作系统</h3>
<div class="outline-text-3" id="text-org4cbe1f8">
<p>
主要内容都在 <code>业务系统</code> 的设计上。
</p>
<ul class="org-ul">
<li>为了前台页面的属性化/场景化搜索，完成了 <code>内容属性化</code> 及 <code>分类目属性模板</code></li>
<li>为了便于销售人员录入，完成了 <code>模板化编辑</code></li>
<li>为了提高审核效率，完成了 <code>AI 质检功能</code> (本质上基于规则，实现指标系统＆规则系统)</li>
<li>为了高效的开展各种新的业务， 完成了 <code>发布对接系统</code> (提供部分扩展点进行标准化接入), 接入多种业务产品(代金券，秒杀业务，KTV，闪惠闪付等产品)</li>
</ul>
</div>
</div>

<div id="outline-container-org4b5f54d" class="outline-3">
<h3 id="org4b5f54d">即时通讯软件</h3>
<div class="outline-text-3" id="text-org4b5f54d">
<p>
负责核心的消息状态群组(PGM)服务器开发
</p>
<ol class="org-ol">
<li>基于 udp 协议自定义高性能通讯框架(用于客户端-服务端通讯)
<ol class="org-ol">
<li>消息分包组包 (考虑到 MTU)</li>
<li>模拟 tcp 做一次 <code>ack</code> 提高可靠性, 以及重试机制.</li>
</ol></li>
<li>基于 Actor 模型完成消息, 状态服务器开发
<ul class="org-ul">
<li>尽可能减少系统中有状态的部分, 状态仅局限在用户/群组信息中</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4969e4b" class="outline-2">
<h2 id="org4969e4b">技能</h2>
<div class="outline-text-2" id="text-org4969e4b">
</div>
<div id="outline-container-org0bf0045" class="outline-3">
<h3 id="org0bf0045">编程语言</h3>
</div>
</div>

    </div>
</section>


<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
